# ElementCategoryFilter Constructor (BuiltInCategory, Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementCategoryFilter Constructor (BuiltInCategory, Boolean)
ElementCategoryFilter Class See Also
---
Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementCategoryFilter(
	BuiltInCategory category,
	bool inverted
)
```

Visual Basic
---
```text
Public Sub New ( _
	category As BuiltInCategory, _
	inverted As Boolean _
)
```

Visual C++
---
```text
public:
ElementCategoryFilter(
	BuiltInCategory category,
	bool inverted
)
```

# ### Parameters
category
    Type: Autodesk.Revit.DB..::..BuiltInCategory The category to match.
inverted
    Type: System..::..Boolean True if the filter should match all elements which are not of the given category.
# See Also
ElementCategoryFilter Class
ElementCategoryFilter Overload
Autodesk.Revit.DB Namespace